{
  "_name_or_path": "AutoTrain",
  "architectures": [
    "SwinForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "depths": [
    2,
    2,
    18,
    2
  ],
  "drop_path_rate": 0.1,
  "embed_dim": 128,
  "encoder_stride": 32,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "id2label": {
    "0": "Bread",
    "1": "Dairy",
    "10": "Soup",
    "11": "Vegetable",
    "2": "Dessert",
    "3": "Egg",
    "4": "Fried Food",
    "5": "Fruit",
    "6": "Meat",
    "7": "Noodles",
    "8": "Rice",
    "9": "Seafood"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "Bread": "0",
    "Dairy": "1",
    "Dessert": "2",
    "Egg": "3",
    "Fried Food": "4",
    "Fruit": "5",
    "Meat": "6",
    "Noodles": "7",
    "Rice": "8",
    "Seafood": "9",
    "Soup": "10",
    "Vegetable": "11"
  },
  "layer_norm_eps": 1e-05,
  "max_length": 128,
  "mlp_ratio": 4.0,
  "model_type": "swin",
  "num_channels": 3,
  "num_heads": [
    4,
    8,
    16,
    32
  ],
  "num_layers": 4,
  "padding": "max_length",
  "patch_size": 4,
  "path_norm": true,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.25.1",
  "use_absolute_embeddings": false,
  "window_size": 7
}
